Tekla Open API Reference for Tekla Structures 2025
PointList.AddRange Method
 Appends all points from another point list to the end of this point list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddRange(
	PointList value
)
Public Sub AddRange (
	value As PointList
)
Parameters
value
Type: Tekla.Structures.Drawing.PointList
The points to be added to the list.
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace